In [ ]:
#objective: Can you predict the fuel-efficieny of a car?

In [2]:
#load libraries
import pandas as pd
import numpy as np
import sklearn
import seaborn as sns
from sklearn import preprocessing
from sklearn.metrics import accuracy_score
from sklearn.metrics import roc_curve, auc, recall_score, precision_score, f1_score, confusion_matrix, recall_score
from sklearn.model_selection import train_test_split
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn import model_selection
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LinearRegression
from sklearn import linear_model

In [15]:
#load data
df = pd.read_table('../datasets/auto_mpg.data', sep="  ", header=None)
df.columns = ['mpg','cylinders','displacement','horsepower','weight',
              'accelaeration','model_year','origin','car_name',"other"]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [16]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,accelaeration,model_year,origin,car_name,other
0,18.0,8,307.0,NaN,130.0,NaN,3504.0,NaN,12.0,70 1\tchevrolet chevelle malibu
1,15.0,8,350.0,NaN,165.0,NaN,3693.0,NaN,11.5,70 1\tbuick skylark 320
2,18.0,8,318.0,NaN,150.0,NaN,3436.0,NaN,11.0,70 1\tplymouth satellite
3,16.0,8,304.0,NaN,150.0,NaN,3433.0,NaN,12.0,70 1\tamc rebel sst
4,17.0,8,302.0,NaN,140.0,NaN,3449.0,NaN,10.5,70 1\tford torino